TheZeroHz/ESP32CSI_Vision/src/cam/sensors/esp32p4_sensor_ops_decl.h
#pragma once
#include "cam/esp32p4_cam_sensor_ops.h"
const esp32p4_cam_sensor_ops_t *ov5647_sensor_ops(void);
const esp32p4_cam_sensor_ops_t *imx708_sensor_ops(void);
const esp32p4_cam_sensor_ops_t *sc2336_sensor_ops(void);
const esp32p4_cam_sensor_ops_t *ov9281_sensor_ops(void);
const esp32p4_cam_sensor_ops_t *os02n10_sensor_ops(void);
const esp32p4_cam_sensor_ops_t *sc035hgs_sensor_ops(void);
const esp32p4_cam_sensor_ops_t *ov2710_sensor_ops(void);
const esp32p4_cam_sensor_ops_t *sc202cs_sensor_ops(void);
const esp32p4_cam_sensor_ops_t *sc1346_sensor_ops(void);
const esp32p4_cam_sensor_ops_t *sc030iot_sensor_ops(void);
const esp32p4_cam_sensor_ops_t *os04c10_sensor_ops(void);
const esp32p4_cam_sensor_ops_t *sti2250_sensor_ops(void);
const esp32p4_cam_sensor_ops_t *mira220_sensor_ops(void);
const esp32p4_cam_sensor_ops_t *sc2331_sensor_ops(void);
const esp32p4_cam_sensor_ops_t *gc2607_sensor_ops(void);
const esp32p4_cam_sensor_ops_t *ov5645_sensor_ops(void);
const esp32p4_cam_sensor_ops_t *ov5640_sensor_ops(void);
const esp32p4_cam_sensor_ops_t *gc2145_sensor_ops(void);
const esp32p4_cam_sensor_ops_t *lt6911_sensor_ops(void);
const esp32p4_cam_sensor_ops_t *sc121at_sensor_ops(void);
const esp32p4_cam_sensor_ops_t *imx219_sensor_ops(void);
const esp32p4_cam_sensor_ops_t *imx477_sensor_ops(void);
const esp32p4_cam_sensor_ops_t *gc2083_sensor_ops(void);
const esp32p4_cam_sensor_ops_t *gc2093_sensor_ops(void);
const esp32p4_cam_sensor_ops_t *imx335_sensor_ops(void);
const esp32p4_cam_sensor_ops_t *imx415_sensor_ops(void);
const esp32p4_cam_sensor_ops_t *ov7251_sensor_ops(void);
const esp32p4_cam_sensor_ops_t *imx296_sensor_ops(void);
const esp32p4_cam_sensor_ops_t *imx462_sensor_ops(void);
const esp32p4_cam_sensor_ops_t *arducam_imx500_sensor_ops(void);
const esp32p4_cam_sensor_ops_t *ov2640_sensor_ops(void);
const esp32p4_cam_sensor_ops_t *sp0a39_sensor_ops(void);
